export const POETRY_MESSAGE = {
  title: "Message in Flowers",
  description: [
    "ปลดล็อกความหมายที่ซ่อนเร้นในบทกวี สู่ถ้อยคำแห่งมวลดอกไม้",
    "ยินดีต้อนรับเข้าสู่แหล่งเรียนรู้",
    "ที่จะเชื่อมคุณกับบทกลอนด้วย",
    "ภาษาดอกไม้",
  ],
  florigraphy: [
    "ภาษาดอกไม้ หรือ FLORIOGRAPHY",
    "คือ การสื่อสารอีกรูปแบบหนึ่งในยุควิคตอเรียโดย",
    "ใช้ดอกไม้ในการสื่อสาร",
    "แสดงถึงความรู้สึกส่วนตัวที่ไม่สามารถบอกออกมาเป็นคำพูดได้",
    "โดยในแต่ละชนิดของดอกไม้จะมี",
    "ความหมายแตกต่างกัน ซึ่งสามารถใช้แทนความรู้สึก",
    "ความคิด หรือข้อความที่ต้องการสื่อได้",
  ],
};

export const FOOTER_CONTENT = {
  description: [
    "เปิดบทเรียนสู่โลก",
    "วรรณคดีไทย",
    "ที่จะพาไปพบกับการถอดรหัสบทกลอน",
    "ให้กลับมามีชีวิตชีวา",
    "ด้วยถ้อยคำจาก",
    "ดอกไม้",
  ],
  buttonText: "Go",
  buttonLink: "/poem-parent",
};
