export interface Poetry {
  id: string;
  title: string;
  subtitle?: string;
  author: string;
  imageSrc: string;
  poem: string;
  meaning: string;
  hasUnderline?: boolean;
  titleColor?: string;
}

export const poetryList: Poetry[] = [
  {
    id: "pleng-yao",
    title: "เพลงยาวถวายโอวาท",
    author: "สุนทรภู่",
    imageSrc: "/poetry/image.png",
    hasUnderline: false,
    poem: `อนึ่งเล่าเข้าที่ศรีไสยาสน์<br/>
           อย่าประมาทหมั่นคำนับลงกับหมอน<br/>
           เป็นนิรันดร์สรรเสริญเจริญพร<br/>
           คุณบิดรมารดาคุณอาจารย์`,
    meaning:
      "ก่อนเข้านอนทุกคืน ให้ระลึกถึงและอธิษฐานสรรเสริญบุญคุณของบิดามารดา ที่ได้อุ้มท้องและเลี้ยงดูเรามาอย่างมากมาย อย่าได้ประมาทหรือละเลยในบุญคุณนี้",
  },
  {
    id: "sawatdi-raksa",
    title: "สวัสดิรักษา",
    author: "สุนทรภู่",
    imageSrc: "/poetry/image-2.png",
    hasUnderline: true,
    poem: `อนึ่งอย่าด่าว่าแต่แม่พ่อ<br/>
           จะเกิดก้อกรรมบาปให้หยาบช้า<br/>
           ถึงร้อยรสบทกลอนอักษรา<br/>
           ไม่เทียบค่าเมตตาที่อารี`,
    meaning:
      "การด่าทอหรือล่วงเกินบิดามารดาเป็นบาปหนักและทำให้ชีวิตมัวหมอง ต่อให้เราจะเป็นคนที่เก่งกาจมีความรู้ก็ไม่มีคุณค่าเท่ากับการมีความเมตตาและกตัญญูต่อพ่อแม่",
  },
  {
    id: "khun-chang-khun-phaen",
    title: "ขุนช้างขุนแผน",
    subtitle: "ตอน กำเนิดพลายงาม",
    author: "สุนทรภู่",
    imageSrc: "/poetry/image-3.png",
    poem: `แม่รักลูกลูกก็รู้อยู่ว่ารักคนอื่นสักหมื่นแสนไม่แม้นเหมือน<br/>
            จะกินนอนวอนว่าเมตตาเตือน<br/>
            จะจากเรือนร้างแม่ไปแต่ตัว<br/>`,
    meaning:
      " ไม่มีรักของใครยิ่งใหญ่และจริงใจเท่ารักของแม่ แม้ยามแม่ดุด่าว่ากล่าวก็ทำด้วยความเมตตา แต่วันนี้ลูกมีความจำเป็นต้องจากแม่ไปเพียงลำพัง",
  },
  {
    id: "Phra Aphai Mani",
    title: "พระอภัยมณี",
    author: "สุนทรภู่",
    imageSrc: "/warning/Phra Aphai Mani-flower.png",
    poem: `แล้วสอนว่าอย่าไว้ใจมนุษย์
          มันแสนสุดลึกล้ำเหลือกำหนด<br>
          ถึงเถาวัลย์พันเกี่ยวที่เลี้ยวลด<br>
          ก็ไม่คดเหมือนหนึ่งในน้ำใจคน`,
    meaning: `เปรียบเปรยว่าเถาวัลย์ที่เลี้ยวลด คดเคี้ยวตามธรรมชาติ ยังไม่น่ากลัวเท่าจิตใจมนุษย์ที่ยากแท้หยั่งถึง ไม่ควรประมาทในการคบคนเพราะอาจเปลี่ยนไปได้ตลอดเวลา`,
  },
  {
    id: "Phra Aphai Mani-2",
    title: "พระอภัยมณี",
    author: "สุนทรภู่",
    imageSrc: "/sadness/sadness-1.png",
    titleColor: "#7DB2D3",
    poem: `อกอะไร จะเหมือนอก ที่รกรัก
          อกจะหัก เสียด้วยใจ อาลัยหา<br />
          ไม่เห็นพักตร์ รักสิ้น ในวิญญาณ์<br />
          จะเป็นบ้า เสียรัก สลักทรวง`,
    meaning:
      "ไม่มีหัวใจดวงใดจะเจ็บปวดเท่าหัวใจที่เต็มไปด้วยความรักที่ค้างคาและโศกเศร้า คิดถึงคนรักจนใจแทบจะแตกสลาย เมื่อไม่ได้เห็นหน้าของคนที่รัก ความรักและความทุกข์นี้ก็แผ่ซ่านไปจนถึงจิตวิญญาณ ความรักที่ฝังลึกอยู่ในใจทำให้ฉันรู้สึกราวกับจะเป็นบ้าไปแล้ว",
  },
  {
    id: "Nirat Inao",
    title: "นิราศอิเหนา",
    author: "สุนทรภู่",
    imageSrc: "/sadness/sadness-2.png",
    titleColor: "#7DB2D3",
    poem: `จะหักอื่น ขืนหัก ก็จักได้
          หักอาลัย นี้ไม่หลุด สุดจะหัก<br />
        สารพัด ตัดขาด ประหลาดนัก<br />
        แต่ตัดรัก นี้ไม่ขาด ประหลาดใจ`,
    meaning:
      "สิ่งอื่นใดในโลกนี้ หากตั้งใจจะหักห้ามใจหรือตัดขาดจากมัน ก็สามารถทำได้สำเร็จ แต่ความรู้สึกอาลัยอาวรณ์รักนี้กลับตัดไม่ขาดเลย ทำอย่างไรก็ทำไม่ได้ ทุกสิ่งทุกอย่างก็ตัดขาดได้หมดอย่างน่าอัศจรรย์ใจ แต่ทำไมความรักนี้ถึงเป็นสิ่งเดียวที่ตัดไม่ขาดเสียที",
  },
  {
    id: "Phra Aphai Mani-3",
    title: "พระอภัยมณี",
    author: "สุนทรภู่",
    imageSrc: "/love/love-image.png",
    titleColor: "#E86686",
    poem: `ถึงม้วยดินสิ้นฟ้ามหาสมุทร <br />             
        ไม่สิ้นสุดความรักสมัครสมาน<br />
        แม้นเกิดในไต้ฟ้าสุธาธาร <br /> 
        ขอพบพานพิศวาสไม่คลาดคลา`,
    meaning:
      "แม้ว่าชีวิตจะหาไม่ ต้องสิ้นสุดไปพร้อมกับโลกทั้งใบ แต่ความรักที่มอบ ให้แก่กันจะไม่มีวันสิ้นสุดลง ",
  },
];
