export interface Poetry {
  id: string;
  title: string;
  subtitle?: string;
  author: string;
  imageSrc: string;
  poem: string;
  meaning: string;
  hasUnderline?: boolean;
  titleColor?: string
}

export const poetryList: Poetry[] = [
  {
    id: "pleng-yao",
    title: "เพลงยาวถวายโอวาท",
    author: "สุนทรภู่",
    imageSrc: "/poetry/image.png",
    hasUnderline: false,
    poem: `อนึ่งเล่าเข้าที่ศรีไสยาสน์<br/>
           อย่าประมาทหมั่นคำนับลงกับหมอน<br/>
           เป็นนิรันดร์สรรเสริญเจริญพร<br/>
           คุณบิดรมารดาคุณอาจารย์`,
    meaning:
      "ก่อนเข้านอนทุกคืน ให้ระลึกถึงและอธิษฐานสรรเสริญบุญคุณของบิดามารดา ที่ได้อุ้มท้องและเลี้ยงดูเรามาอย่างมากมาย อย่าได้ประมาทหรือละเลยในบุญคุณนี้",
  },
  {
    id: "sawatdi-raksa",
    title: "สวัสดิรักษา",
    author: "สุนทรภู่",
    imageSrc: "/poetry/image-2.png",
    hasUnderline: true,
    poem: `อนึ่งอย่าด่าว่าแต่แม่พ่อ<br/>
           จะเกิดก้อกรรมบาปให้หยาบช้า<br/>
           ถึงร้อยรสบทกลอนอักษรา<br/>
           ไม่เทียบค่าเมตตาที่อารี`,
    meaning:
      "การด่าทอหรือล่วงเกินบิดามารดาเป็นบาปหนักและทำให้ชีวิตมัวหมอง ต่อให้เราจะเป็นคนที่เก่งกาจมีความรู้ก็ไม่มีคุณค่าเท่ากับการมีความเมตตาและกตัญญูต่อพ่อแม่",
  },
  {
    id: "khun-chang-khun-phaen",
    title: "ขุนช้างขุนแผน",
    subtitle: "ตอน กำเนิดพลายงาม",
    author: "สุนทรภู่",
    imageSrc: "/poetry/image-3.png",
    poem: `แม่รักลูกลูกก็รู้อยู่ว่ารักคนอื่นสักหมื่นแสนไม่แม้นเหมือน<br/>
            จะกินนอนวอนว่าเมตตาเตือน<br/>
            จะจากเรือนร้างแม่ไปแต่ตัว<br/>`,
    meaning:
      " ไม่มีรักของใครยิ่งใหญ่และจริงใจเท่ารักของแม่ แม้ยามแม่ดุด่าว่ากล่าวก็ทำด้วยความเมตตา แต่วันนี้ลูกมีความจำเป็นต้องจากแม่ไปเพียงลำพัง",
  },
  {
    id: "Phra Aphai Mani",
    title: "พระอภัยมณี",
    author: "สุนทรภู่",
    imageSrc: "/warning/Phra Aphai Mani-flower.png",
    poem: `แล้วสอนว่าอย่าไว้ใจมนุษย์
          มันแสนสุดลึกล้ำเหลือกำหนด<br>
          ถึงเถาวัลย์พันเกี่ยวที่เลี้ยวลด<br>
          ก็ไม่คดเหมือนหนึ่งในน้ำใจคน`,
    meaning: `เปรียบเปรยว่าเถาวัลย์ที่เลี้ยวลด คดเคี้ยวตามธรรมชาติ ยังไม่น่ากลัวเท่าจิตใจมนุษย์ที่ยากแท้หยั่งถึง ไม่ควรประมาทในการคบคนเพราะอาจเปลี่ยนไปได้ตลอดเวลา`,
  },
];
